blog/2021/lc-217-contains-duplicate.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-02-09 Wed 12:01 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>LC217. 存在重复元素</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.4.0/build/styles/base16/dracula.min.css">
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">LC217. 存在重复元素</h1>
</header><p>
今天思考 LeetCode 题目：存在重复元素<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>。
</p>

<div id="outline-container-orgcfcdd68" class="outline-2">
<h2 id="orgcfcdd68">题目描述</h2>
<div class="outline-text-2" id="text-orgcfcdd68">
<p>
给定一个整数数组，判断是否存在重复元素。
</p>

<p>
如果存在一值在数组中出现至少两次，函数返回 <code>true</code> 。如果数组中每个元素都不相同，则返回 <code>false</code> 。
</p>
</div>
</div>

<div id="outline-container-org0fed667" class="outline-2">
<h2 id="org0fed667">题解<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup></h2>
<div class="outline-text-2" id="text-org0fed667">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #7c7565;">/**</span>
<span style="color: #7c7565;"> * @param {number[]} nums</span>
<span style="color: #7c7565;"> * @return {boolean}</span>
<span style="color: #7c7565;"> */</span>
<span style="color: #91a0b3;">var</span> <span style="color: #aaca86;">containsDuplicate</span> = <span style="color: #91a0b3;">function</span> (<span style="color: #aaca86;">nums</span>) {
  nums.sort((a, b) =&gt; a - b);
  <span style="color: #91a0b3;">for</span> (<span style="color: #91a0b3;">let</span> <span style="color: #aaca86;">i</span> = 0; i &lt; nums.length; i++) {
    <span style="color: #91a0b3;">if</span> (nums[i] == nums[i - 1]) {
      <span style="color: #91a0b3;">return</span> <span style="color: #ab85a3;">true</span>;
    }
  }
  <span style="color: #91a0b3;">return</span> <span style="color: #ab85a3;">false</span>;
};
</pre>
</div>

<p>
代码的 for 循环、if 语句，是我写的。原来的 if 语句还有 else 从句，后来去掉，把 else 中的 return false 移动到了外面。
</p>

<p>
<code>nums.sort</code> 是来自别人的。
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
<a href="https://leetcode-cn.com/problems/contains-duplicate/">https://leetcode-cn.com/problems/contains-duplicate/</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
<a href="https://leetcode-cn.com/problems/contains-duplicate/solution/cun-zai-zhong-fu-yuan-su-by-leetcode-sol-iedd/">https://leetcode-cn.com/problems/contains-duplicate/solution/cun-zai-zhong-fu-yuan-su-by-leetcode-sol-iedd/</a></p></div></div>


</div>
</div></div>
</body>
</html>